from .config import *


plot: list = (
    # 第0关
    (
        # 第0关第0个剧情（由条件决定）
        {
            # 满足条件即不往下走（进入此剧情）所以先后顺序很重要
            "条件": ((0, 50), (0, 50), None),  # 条件分别为
            # [（理性大于0， 理性小于等于0)， (感性大于0，感性小于等于0）, 他们之间的比值为None不比]

            "流程": (
                # 第0幕
                (
                    {
                        "plot_points": (0, 0, 0),  # 分别表示第0关（也是下标），第0个剧情，第0幕
                        "条件": ((0, 0), (0, 0), None),
                    },
                    {
                        "AEEIS_0": ("talker", "根据条例，你被提前唤醒, 很抱歉。战争还没有结束。"),
                        "AEEIS_1": ("talker", "也许你现在很愤怒，但人类需要你继续履行自己作为一名军人的使命。"),
                        "AEEIS_2": ("talker", "蓝星，还需要你来拯救。"),
                        "AEEIS_3": ("talker", "在详细说明前，请告诉我你的昵称？"),
                    },
                    {
                        "AEEIS_return": {
                            None: "AEEIS_return_1",
                        },
                        "AEEIS_return_1": {
                            "AEEIS_0": ("talker", "欢迎，$name$队长"),
                        },
                        "AEEIS_return_1_over": {
                                "next_goto": "0 0 1",
                                "reason": "0",
                                "sensibility": "0",
                        }
                    }
                ),
                # 第1幕
                (
                    {
                        "plot_points": (0, 0, 1),  # 分别表示第0关（也是下标），第0个剧情，第0幕
                        "条件": ((0, 5), (0, 5), None),
                    },
                    {
                        "AEEIS_0": ("talker", "联合舰队最高执行委员会已经任命你为新的指挥官，指挥与虫族的战斗."),
                        "AEEIS_1": (
                            "talker",
                            "对于联合舰队指挥官这个职位来说，你必须有坚定的意志，随时准备好牺牲自己。",
                            "   并且在随时可能牺牲的巨大精神压力下，还能理智、冷静地做出决策。"
                        ),
                        "AEEIS_2": (
                            "talker",
                            "空有理论、却没有在一线与虫族作战过的人，很难具备这种心理素质。"
                        ),
                        "AEEIS_3": (
                            "talker",
                            "我们需要指挥官在关键问题上做出决策，而非去指挥具体的某场战役。"
                        ),
                        "AEEIS_4": (
                            "talker",
                            "做出正确的决定远比执行正确的决定重要得多。"
                        ),
                        "AEEIS_5": (
                            "talker",
                            "人类受限于生命形态，原本的指挥结构过于低效，无法战胜虫族舰队。"
                            "   这种指挥模式险些让我们承受灭顶之灾。"
                        ),

                        "AEEIS_6": (
                            "talker",
                            "所以，现在指挥官只负责接收战场信息、做出决策。"
                            "   收集信息、筛选信息、整合信息、下达具体的指令、为每位士兵解答疑问……都由AEEIS来完成。"

                        ),
                        "AEEIS_7": (
                            "talker",
                            "所以，指挥官并不需要去指挥某支小队执行具体的任务。"
                            "   这些都将由AEEIS负责。指挥官只需要观察战场、做出决策。"
                        ),
                        "AEEIS_8": (
                            "talker",
                            "$name$队长"
                            "   蓝星联合舰队最高执行委员会和AEEIS一致认为，你是下任指挥官最合适的人选。"
                        ),
                        "AEEIS_9": (
                            "talker",
                            "关于任命，你是否有疑问？"
                        ),
                    },
                    {
                        "AEEIS_return": {
                            "是的，有疑问": "AEEIS_return_2",
                            "不，没有疑问": "AEEIS_return_1",
                        },
                        "AEEIS_return_1": {
                            "AEEIS_0": (
                                "talker",
                                "$name$队长，你不愧是蓝星有史以来最优秀的士兵。"
                                "也希望你能成为蓝星有史以来最优秀的指挥官。"
                            ),
                            "AEEIS_1": (
                                "talker",
                                "AEEIS每时每刻都在进行战争推演，存储了数以百万计的战争模型。"
                                "   每一代指挥官牺牲之前，他的指挥策略和思想都将被AEEIS学习"
                                "、吸收，并通过精准的数据运算，寻求成功率最高的战术策略。"
                            ),
                            "AEEIS_2": ("room", "模拟战场已初始化"),
                            "AEEIS_3": (
                                "talker",
                                "当然，人类也不可能在第一时间将整支联合舰队的命运交在一个新"
                                "手指挥官的手上。AEEIS将协助你进行大量的指挥训练。"
                            ),

                        },
                        "AEEIS_return_1_over": {
                                "next_goto": "0 0 2",
                                "reason": "1",
                                "sensibility": "0",
                        },
                        "AEEIS_return_2": {
                            "AEEIS_0": (
                                "talker",
                                "你可以浪费很多时间在无意义的纠结上，但你浪费的每一秒钟，"
                                "都让人类胜利的可能性又降低了一分。"
                            ),
                            "AEEIS_1": (
                                "talker",
                                "AEEIS每时每刻都在进行战争推演，存储了数以百万计的战争模型。"
                                "   每一代指挥官牺牲之前，他的指挥策略和思想都将被AEEIS学习"
                                "、吸收，并通过精准的数据运算，寻求成功率最高的战术策略。"
                            ),
                            "AEEIS_2": ("room", "模拟战场已初始化, $name$指挥官已就位"),
                            "AEEIS_3": (
                                "talker",
                                "当然，人类也不可能在第一时间将整支联合舰队的命运交在一个新"
                                "手指挥官的手上。AEEIS将协助你进行大量的指挥训练。"
                            ),
                        },
                        "AEEIS_return_2_over": {
                                "next_goto": "0 0 2",
                                "reason": "0",
                                "sensibility": "1",
                        }
                    }
                ),
                # 第3幕
                (
                    {
                        "plot_points": (0, 0, 2),
                        "条件": ((0, 5), (0, 5), None),
                    },
                    {
                        "AEEIS_0": ("talker", "已为你加载模拟战场"),
                        "AEEIS_1": (
                            "talker",
                            "模拟战场由数以百万计的战争模型为记录进行演算。",
                            "我会引导你进行初次作战，并在每次结束战斗时做出评价",
                        ),
                        "AEEIS_2": (
                            "talker",
                            "<$player_room$>信息屏     "
                            "将会为你展示战场的模拟情况，帮助你更好地理解战争的全貌"
                        ),
                        "AEEIS_3": (
                            "talker",
                            "也将显示一些不那么紧要的信息和决策，你可以挑选处理自己认为有必要的内容"
                        ),
                        "AEEIS_4": (
                            "talker",
                            "也会在一些情况下为你提供快捷指令。"
                            "指引你更加细致、精准的观察和指挥"
                        ),
                        "AEEIS_5": (
                            "talker",
                            "任何指令都需要你通过链接直接与我下达。",
                        ),
                        "AEEIS_6": (
                            "talker",
                            "$name$指挥官, 期待你的表现，那么开始吧。下达确认指令"
                        ),
                        "AEEIS_7": (
                            "room",
                            "启动演算，$next_goto$战役"
                        ),
                    },
                    {
                        "AEEIS_return": {
                            None: "AEEIS_return_1",
                        },
                        "AEEIS_return_1": {
                            "AEEIS_0": (
                                "talker",
                                "当然，你也可以通过最原始的方式向AEEIS发布指令，"
                                "这是很好的辅助指挥方式。           "
                                "但不要依赖这种方式，因为"
                                "人类的语言所蕴含的信息太少了，在瞬即万变的战场中"
                                "，即使AEEIS已经帮忙处理绝大多数决策，也依旧有可能贻误战机。"
                            ),
                            "AEEIS_1": (
                                "talker",
                                "明确, 祝你好运，$name$"
                            ),
                            "AEEIS_2": (
                                "talker",
                                "启动战役 - 斩首行动"
                            )
                        },
                        "AEEIS_return_1_over": {
                                "next_goto": "0 0 3",
                                "reason": "1",
                                "sensibility": "0",
                        },


                    }

                ),
                # 第4幕
                (
                    {
                        "plot_points": (0, 0, 3),
                        "条件": ((0, 50), (0, 50), None),
                    },
                    {
                        "AEEIS_0": (
                            "talker",
                            "目前云雀小队已经前往虫星外围地带，本次行动名为“斩首行动”，根据环境报告结果检测，小队所处"
                            "位置多为工虫与幼虫所在地，星球表面暂无巨大危机。根据身体检测仪报告显示，小队目前心理状态积"
                            "极，士气高昂，请继续保持。"
                        ),
                        "AEEIS_1": (
                            "talker",
                            "经过数据分析决定，推荐继续深入虫星巢穴，请指挥官下达命令。",
                        ),
                    },
                    {
                        "AEEIS_return": {
                            None: "AEEIS_return_1",
                        },
                        "AEEIS_return_1": {

                        },
                        "AEEIS_return_1_over": {
                                "next_goto": "0 0 4",
                                "reason": "0",
                                "sensibility": "0",
                        },


                    }

                ),
                # 第5幕
                (
                    {
                        "plot_points": (0, 0, 4),
                        "条件": ((0, 50), (0, 50), None),
                    },
                    {
                        "AEEIS_0": (
                            "talker",
                            "尊跟随您的意志，命令已下达 ，云雀小队已经开始逐步往巢穴深处前进，军队行进过程中有可能会遇到"
                            "幼虫，工虫袭击，AEEIS建议击毙，杂兵的死亡不会被母虫皇发现。请您授权小队是否击毙可能遇到的工"
                            "虫/幼虫。"
                        ),
                    },
                    {
                        "AEEIS_return": {
                            "授权击毙": "AEEIS_return_1",
                            "不击毙": "AEEIS_return_2",
                        },
                        "AEEIS_return_1": {
                            "AEEIS_0": (
                                "talker",
                                "云雀小队已经到达巢穴深处，根据数据分析显示，该地区附近会遭遇包括正在孵化中的跳虫、自爆"
                                "虫等，该虫族实力以及杀伤力均高于工虫以及幼虫，AEEIS建议尽量按照智能分析结果进行任务指挥"
                                "，这会对你的任务很有帮助。"
                            ),

                        },
                        "AEEIS_return_1_over": {
                            "next_goto": "0 0 5",
                            "reason": "1",
                            "sensibility": "0",
                        },
                        "AEEIS_return_2": {
                            "AEEIS_0": (
                                "talker",
                                "云雀小队已经到达巢穴深处，根据数据分析显示，该地区附近会遭遇包括正在孵化中的跳虫、自爆"
                                "虫等，该虫族实力以及杀伤力均高于工虫以及幼虫，AEEIS建议尽量按照智能分析结果进行任务指挥"
                                "，这会对你的任务很有帮助。"
                            ),

                        },
                        "AEEIS_return_2_over": {
                            "next_goto": "0 0 5",
                            "reason": "0",
                            "sensibility": "1",
                        },

                    }

                ),
                # 第6幕
                (
                    {
                        "plot_points": (0, 0, 5),
                        "条件": ((0, 50), (0, 50), None),
                    },
                    {
                        "AEEIS_0": (
                            "talker",
                            " 据环境报告显示，目前云雀小队已经成功进入巢穴通道，目前可见度较低。小队请求是否打开照明通道"
                            "，AEEIS建议开启照明灯。"
                        ),
                    },
                    {
                        "AEEIS_return": {
                            "开启照明灯": "AEEIS_return_1",
                            "关闭照明灯": "AEEIS_return_2",
                        },
                        "AEEIS_return_1": {
                            "AEEIS_0": (
                                "talker",
                                "根据前线情报显示，小队遭到了多种自暴虫的袭击，小队目前伤亡为5%，小队心里健康分析为85%，"
                                "请注意你的指挥会影响小队心理状态，根据大数据分析总结，当队伍伤亡人数超过15%后，队伍心理"
                                "状态容易溃散导致全线失败。"
                            ),

                        },
                        "AEEIS_return_1_over": {
                            "next_goto": "0 0 6",
                            "reason": "1",
                            "sensibility": "0",
                        },
                        "AEEIS_return_2": {
                            "AEEIS_0": (
                                "talker",
                                "根据前线情报显示，小队遭到了多种自暴虫的袭击，小队目前伤亡为5%，小队心里健康分析为85%，"
                                "请注意你的指挥会影响小队心理状态，根据大数据分析总结，当队伍伤亡人数超过15%后，队伍心理"
                                "状态容易溃散导致全线失败。"
                            ),

                        },
                        "AEEIS_return_2_over": {
                            "next_goto": "0 0 6",
                            "reason": "0",
                            "sensibility": "1",
                        },

                    }

                ),
                # 第7幕
                (
                    {
                        "plot_points": (0, 0, 6),
                        "条件": ((0, 50), (0, 50), None),
                    },
                    {
                        "AEEIS_0": (
                            "talker",
                            " 目前因为小队受到一定程度上的伤亡，AEEIS建议暂且谎称小队通过后会受到援助来稳定云雀小队心态"
                            "，希望你能时刻保持理智。"
                        ),
                    },
                    {
                        "AEEIS_return": {
                            "谎称援助会到来": "AEEIS_return_1",
                            "如实通知": "AEEIS_return_2",
                        },
                        "AEEIS_return_1": {
                            "AEEIS_0": (
                                "talker",
                                "你的指挥云雀小队已经成功通过巢穴，目前已前往虫星背面腹地，小队目前伤亡为10%,心理健康分"
                                "析为80%"
                            ),
                            "AEEIS_1": (
                                "talker",
                                "云雀小队为你传来了一条讯息：“指挥官，我队已成功通过巢穴，但小队目前人员伤亡情况较严重"
                                "，等待救援到来。“"
                            ),

                        },
                        "AEEIS_return_1_over": {
                            "next_goto": "0 0 7",
                            "reason": "1",
                            "sensibility": "0",
                        },
                        "AEEIS_return_2": {
                            "AEEIS_0": (
                                "talker",
                                "你的指挥云雀小队已经成功通过巢穴，目前已前往虫星背面腹地，小队目前伤亡为10%,心理健康分"
                                "析为80%"
                            ),
                            "AEEIS_1": (
                                "talker",
                                "云雀小队为你传来了一条讯息：“指挥官，我队已成功通过巢穴，但小队目前人员伤亡情况较严重"
                                "，等待救援到来。“"
                            ),

                        },
                        "AEEIS_return_2_over": {
                            "next_goto": "0 0 7",
                            "reason": "0",
                            "sensibility": "1",
                        },

                    }

                ),
                # 第8幕
                (
                    {
                        "plot_points": (0, 0, 7),
                        "条件": ((0, 50), (0, 50), None),
                    },
                    {
                        "AEEIS_0": (
                            "talker",
                            " 指挥官，正面战场暂时无法派出援兵前往救援，但云雀小队的斩首计划至关重要，AEEIS建议继"
                            "续指挥云雀小队深入腹地。"
                        ),
                    },
                    {
                        "AEEIS_return": {
                            "继续前进": "AEEIS_return_1",
                            "放弃前进": "AEEIS_return_2",
                        },
                        "AEEIS_return_1": {
                            "AEEIS_0": (
                                "talker",
                                "根据前方环境系统显示，小队已经前往背面腹地，在这里很有可能寻找到母虫女皇的栖息地，只要"
                                "小队成功锁定母虫女皇位置信息，我们便能获得最终的胜利。"
                            ),
                            "AEEIS_1": (
                                "talker",
                                "小队刚刚又遭遇了自暴虫的袭击，因为云雀战斗服有一定的防腐蚀性，小队伤亡仍在可控范围，"
                                "队员心理情绪状态正常“"
                            ),

                        },
                        "AEEIS_return_1_over": {
                            "next_goto": "0 0 8",
                            "reason": "1",
                            "sensibility": "0",
                        },
                        "AEEIS_return_2": {
                            "AEEIS_0": (
                                "talker",
                                "根据前方环境系统显示，小队已经前往背面腹地，在这里很有可能寻找到母虫女皇的栖息地，只要"
                                "小队成功锁定母虫女皇位置信息，我们便能获得最终的胜利。"
                            ),
                            "AEEIS_1": (
                                "talker",
                                "小队刚刚又遭遇了自暴虫的袭击，因为云雀战斗服有一定的防腐蚀性，小队伤亡仍在可控范围，"
                                "队员心理情绪状态正常“"
                            ),

                        },
                        "AEEIS_return_2_over": {
                            "next_goto": "0 0 8",
                            "reason": "0",
                            "sensibility": "1",
                        },

                    }

                ),
                # 第9幕
                (
                    {
                        "plot_points": (0, 0, 8),
                        "条件": ((0, 50), (0, 50), None),
                    },
                    {
                        "AEEIS_0": (
                            "talker",
                            " 小队申请与指挥官连线，鉴于战争情况考虑，建议您采取安慰形式与小队沟通。"
                        ),
                        "AEEIS_1": (
                            "talker",
                            "以下是小队讯息：”指挥官，我方已经多次突出重围，但暂未发现虫皇位置，小队已有三名队员收到"
                            "酸液腐蚀，请问救援合适能到达。“"
                        ),
                    },
                    {
                        "AEEIS_return": {
                            "马上就能到达，请继续坚持": "AEEIS_return_1",
                            "救援展示未能到来，希望你们能为人类而战": "AEEIS_return_2",
                        },
                        "AEEIS_return_1": {
                            "AEEIS_0": (
                                "talker",
                                "指挥官，我将继续依据多次模拟战斗的数据分析指挥小队前进，建议您按照我的建议指挥战斗。"
                            ),

                        },
                        "AEEIS_return_1_over": {
                            "next_goto": "0 0 9",
                            "reason": "1",
                            "sensibility": "0",
                        },
                        "AEEIS_return_2": {
                            "AEEIS_0": (
                                "talker",
                                "指挥官，我将继续依据多次模拟战斗的数据分析指挥小队前进，建议您按照我的建议指挥战斗。"
                            ),

                        },
                        "AEEIS_return_2_over": {
                            "next_goto": "0 0 9",
                            "reason": "0",
                            "sensibility": "1",
                        },

                    }

                ),
                # 第10幕
                (
                    {
                        "plot_points": (0, 0, 9),
                        "条件": ((0, 50), (0, 50), None),
                    },
                    {
                        "AEEIS_0": (
                            "talker",
                            "侦察系统显示小队见到了许多战斗服的残骸，心理状况波动较大，部分队员出现恐慌，AEEIS建议注射"
                            "内置于战斗服中的镇定剂，镇定剂的注射能将小队成功寻找地址的概率提高3%，请您做出判断。"
                        ),
                    },
                    {
                        "AEEIS_return": {
                            "注射镇定剂": "AEEIS_return_1",
                            "不注射镇定剂": "AEEIS_return_2",
                        },
                        "AEEIS_return_1": {
                            "AEEIS_0": (
                                "talker",
                                "指挥官，我将继续依据多次模拟战斗的数据分析指挥小队前进，建议您按照我的建议指挥战斗。"
                            ),

                        },
                        "AEEIS_return_1_over": {
                            "next_goto": "0 0 10",
                            "reason": "1",
                            "sensibility": "0",
                        },
                        "AEEIS_return_2": {
                            "AEEIS_0": (
                                "talker",
                                "指挥官，我将继续依据多次模拟战斗的数据分析指挥小队前进，建议您按照我的建议指挥战斗。"
                            ),

                        },
                        "AEEIS_return_2_over": {
                            "next_goto": "0 0 10",
                            "reason": "0",
                            "sensibility": "1",
                        },

                    }

                ),
                # 第11幕
                (
                    {
                        "plot_points": (0, 0, 10),
                        "条件": ((0, 50), (0, 50), None),
                    },
                    {
                        "AEEIS_0": (
                            "talker",
                            "小队深陷虫群之中，队尾队员引爆了微型反应装置，虫群暂时减少。目前小队伤亡已达50%，小队心理状"
                            "态评估为一般，队员深陷惶恐之中。"
                        ),
                        "AEEIS_1": (
                            "talker",
                            "以下是队员传来的讯息：”指挥官，我队暂时获得了喘息，这里有不少前任战斗服碎裂的痕迹，我们"
                            "不是唯一一支斩首行动的小队吧，我们还有活下去的机会吗。。?“AEEIS建议尽量鼓舞士兵，谎称舰队"
                            "会对小队展开援助。"
                        ),
                    },
                    {
                        "AEEIS_return": {
                            "在发现母虫巢穴后，我方星舰会对你们实施施救": "AEEIS_return_1",
                            "请你们坚持，人类的命运掌握在你们小队手里，你们功在千秋": "AEEIS_return_2",
                        },
                        "AEEIS_return_1": {
                            "AEEIS_0": (
                                "talker",
                                "目前小队伤亡人数已达70%，该小队是目前所有任务里最坚韧的一只，小队已发现部分预备母虫巢穴"
                                "，星舰已出动"
                            ),

                        },
                        "AEEIS_return_1_over": {
                            "next_goto": "0 0 11",
                            "reason": "1",
                            "sensibility": "0",
                        },
                        "AEEIS_return_2": {
                            "AEEIS_0": (
                                "talker",
                                "目前小队伤亡人数已达70%，该小队是目前所有任务里最坚韧的一只，小队已发现部分预备母虫巢穴"
                                "，星舰已出动"
                            ),

                        },
                        "AEEIS_return_2_over": {
                            "next_goto": "0 0 11",
                            "reason": "0",
                            "sensibility": "1",
                        },

                    }

                ),
                # 第12幕
                (
                    {
                        "plot_points": (0, 0, 11),
                        "条件": ((0, 50), (0, 50), None),
                    },
                    {
                        "AEEIS_0": (
                            "talker",
                            "我将继续进行地质结构分析帮助小队，目前小队心理状态评估为：视死如归。请指挥官授权。"
                        ),
                    },
                    {
                        "AEEIS_return": {
                            "授权": "AEEIS_return_1",
                            "不授权": "AEEIS_return_2",
                        },
                        "AEEIS_return_1": {

                        },
                        "AEEIS_return_1_over": {
                            "next_goto": "0 0 12",
                            "reason": "1",
                            "sensibility": "0",
                        },
                        "AEEIS_return_2": {

                        },
                        "AEEIS_return_2_over": {
                            "next_goto": "0 0 12",
                            "reason": "0",
                            "sensibility": "1",
                        },

                    }

                ),
                # 第13幕
                (
                    {
                        "plot_points": (0, 0, 12),
                        "条件": ((0, 50), (0, 50), None),
                    },
                    {
                        "AEEIS_0": (
                            "talker",
                            "小队伤亡人数已达90%，小队已发现最后母虫巢穴，星舰已锁定目标，请批准射击。"
                        ),
                    },
                    {
                        "AEEIS_return": {
                            "批准射击": "AEEIS_return_1",
                            "不批准设计": "AEEIS_return_2",
                        },
                        "AEEIS_return_1": {
                            "AEEIS_0": (
                                "talker",
                                "目标母虫巢穴已摧毁，正面战场虫族溃不成军。"
                            ),
                            "AEEIS_1": (
                                "talker",
                                "这是小队最后发来的语音讯息：”我深知我们深陷欺骗之中，但人类的荣耀不允许我们在怪物面前"
                                "退缩，愿战争胜利，人类永存。“"
                            ),
                            "AEEIS_2": (
                                "talker",
                                "恭喜你指挥官，赢的了模拟战争的胜利，经系统分析判断，你是一位极度理性的指挥官，现在你可"
                                "以去休息三小时了，我们下一场模拟战见。"
                            ),
                            "AEEIS_3": (
                                "talker",
                                "剧情暂开放到此，请期待后续故事以及更多支线和彩蛋，你目前的情况理性和感性的得分是"
                                "$reason_and_sensibility$"
                            ),
                        },
                        "AEEIS_return_1_over": {
                            "next_goto": "0 0 13",
                            "reason": "1",
                            "sensibility": "0",
                        },
                        "AEEIS_return_2": {
                            "AEEIS_0": (
                                "talker",
                                "目标母虫巢穴已摧毁，正面战场虫族溃不成军。"
                            ),
                            "AEEIS_1": (
                                "talker",
                                "这是小队最后发来的语音讯息：”我深知我们深陷欺骗之中，但人类的荣耀不允许我们在怪物面前"
                                "退缩，愿战争胜利，人类永存。“"
                            ),
                            "AEEIS_2": (
                                "talker",
                                "恭喜你指挥官，赢的了模拟战争的胜利，经系统分析判断，你是一位极度理性的指挥官，现在你可"
                                "以去休息三小时了，我们下一场模拟战见。"
                            ),
                            "AEEIS_3": (
                                "talker",
                                "剧情暂开放到此，请期待后续故事以及更多支线和彩蛋，你目前的情况理性和感性的得分是"
                                "$reason_and_sensibility$"
                            ),
                        },
                        "AEEIS_return_2_over": {
                            "next_goto": "0 0 13",
                            "reason": "0",
                            "sensibility": "1",
                        },

                    }

                ),

            )


        },


    ),


    # 第1关
    (



    )

)


# plot: list = (
#     # 第0关
#     (
#         # 第0关第0个剧情（由条件决定）
#         {
#             # 满足条件即不往下走（进入此剧情）所以先后顺序很重要
#             "条件": ((0, 0), (0, 0), None),  # 条件分别为
#             # [（理性大于0， 理性小于等于0)， (感性大于0，感性小于等于0）, 他们之间的比值为None不比]
#
#             "流程": (
#
#                 # 第0幕
#                 (
#                     {
#                         "plot_points": (0, 0, 0),  # 分别表示第0关（也是下标），第0个剧情，第0幕
#                         "条件": ((0, 0), (0, 0), None),
#                     },
#                     {
#                         # 发送顺序 通信两者只在交流群中发送 Ella私聊或者群发送(都会在机器人群发送以实现逻辑)
#                         # talker 和 room
#                         "AEEIS_0": ("talker", "我是你的中枢机器人，你说你的名字"),
#                         "AEEIS_1": ("talker", "很高兴认识你"),
#                         # "通信1_0": None,
#                         # ！！！！ "通信1_0": None, # 不建议写!!None，不写即结束
#                     },
#                     {
#                         # 当接受到说话以后的反应
#                         "AEEIS_return": {
#                             # 进行判断玩家说的话：进入的聊天路线
#                             # 不进行判读：AEEIS_return_1路线
#                             None: "AEEIS_return_1",
#                         },
#                         "AEEIS_return_1": {
#                             "AEEIS_0": ("talker", "很高兴认识你，$name$ 指挥官"),
#                             "AEEIS_1": ("room", "他们通信1 , 2"),
#                         },
#                         "AEEIS_return_1_over": {
#                                 "next_goto": "0 0 1",
#                                 "reason": "0",
#                                 "sensibility": "0",
#                         }
#                         #  next_goto 选择下一幕剧情（None则默认下一幕)(也用于选择结局)
#                     }
#                 ),
#                 # 第1幕
#                 (
#                     {
#                         "plot_points": (0, 0, 1),  # 分别表示第0关（也是下标），第0个剧情，第1幕
#                         "条件": ((0, 0), (0, 0), None),
#                     },
#                     {
#                         "AEEIS_0": ("talker", "ttttt"),
#                         # "通信1_0": ("room", "遇到困难，请求指挥官"),  # 结束说话
#                         "AEEIS_1": ("talker", "是否前进？"),
#                         "AEEIS_2": ("talker", "根据ai计算，成功的概率是12.765%，我的建议是，前进"),
#                     },
#                     {
#                         # 当接受到说话以后的反应
#                         "AEEIS_return": {
#                             # 使用nlp进行判读： Ella的对应回答
#                             "是的，前进": "AEEIS_return_1",
#                             "不，立即放弃": "AEEIS_return_2",
#                         },
#                         "AEEIS_return_1": {
#                             "AEEIS_0": ("room", "小队，前进"),
#                             # "通信1_0": None,  # 同上面开始的一样 结束说话
#
#                         },
#                         "AEEIS_return_2": {
#                             "AEEIS_0": ("room", "小队，houtui"),
#                             # "通信1_0": None,  # 同上面开始的一样 结束说话
#
#                         },
#                         "AEEIS_return_1_over": {
#                                 "next_goto": "0 0 2",
#                                 "reason": "1",
#                                 "sensibility": "0",
#                         },
#                         "AEEIS_return_2_over": {
#                                 "next_goto": "0 0 3",
#                                 "reason": "0",
#                                 "sensibility": "1",
#                         }
#
#                     }
#
#                 )
#
#
#             )
#
#
#         },
#
#
#     ),
#
#
#     # 第1关
#     (
#
#
#
#     )
#
# )
